project_uas_ecommerce/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'esta@gmail.com'
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();