project_uas_ecommerce/app/Views/admin/index.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
        <?php foreach ($orders as $order): ?>
            <?php
            $productModel = new \App\Models\ProductModel();
            $product = $productModel->find($order['product_id']);
            $userModel = new \App\Models\UserModel();
            $user = $userModel->find($order['user_id']);