project_uas_ecommerce/app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `orders`
---
    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session()->get('user_id'));
        if ($user['username'] !== 'admin') {
            return redirect()->to('/')->with('error', 'Akses ditolak. Hanya admin yang bisa masuk.');
        }

        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->findAll();

SELECT *
FROM `orders`
WHERE `orders`.`id` = '4'
UPDATE `orders` SET `shipping_status` = 'shipped'
WHERE `orders`.`id` IN ('4')
---
    public function ship($orderId)
    {
        $orderModel = new OrderModel();
        $order = $orderModel->find($orderId);
        if ($order && $order['status'] === 'confirmed') {
            $orderModel->update($orderId, ['shipping_status' => 'shipped']);