project_uas_ecommerce/app/Controllers/Cart.php

SELECT *
FROM `orders`
WHERE `user_id` = '3'
AND `payment_status` = 'pending'
---
    public function payment()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/login')->with('error', 'Silakan login untuk melakukan pembayaran.');
        }

        $userId = session()->get('user_id');
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->where(['user_id' => $userId, 'payment_status' => 'pending'])->findAll();