project_uas_ecommerce/app/Controllers/Order.php

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
---
    public function create($productId)
    {
        $productModel = new ProductModel();
        $data['product'] = $productModel->find($productId);

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
INSERT INTO `orders` (`user_id`, `product_id`, `quantity`, `total_price`, `status`, `shipping_status`, `payment_status`) VALUES ('3', '3', '3', 390000, 'pending', 'pending', 'pending')
---
    public function store()
    {
        $orderModel = new OrderModel();
        $productId = $this->request->getPost('product_id');
        $quantity = $this->request->getPost('quantity');

        $productModel = new ProductModel();
        $product = $productModel->find($productId);
        if (!$product) {
            return redirect()->to('/')->with('error', 'Produk tidak ditemukan.');
        }

        // Check stock availability
        if ($product['stock'] < $quantity) {
            return redirect()->to('/product/' . $productId)->with('error', 'Stok tidak mencukupi. Sisa stok: ' . $product['stock']);
        }

        $totalPrice = $product['price'] * $quantity;

        $orderModel->save([
            'user_id' => session()->get('user_id'),
            'product_id' => $productId,
            'quantity' => $quantity,
            'total_price' => $totalPrice,
            'status' => 'pending',
            'shipping_status' => 'pending',
            'payment_status' => 'pending'
        ]);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '20'
---
    public function uploadProof($orderId)
    {
        $orderModel = new OrderModel();
        $order = $orderModel->find($orderId);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '19'
---
    public function cancelPayment($orderId)
    {
        $orderModel = new OrderModel();
        $productModel = new ProductModel();
        $order = $orderModel->find($orderId);

UPDATE `orders` SET `status` = 'cancelled', `shipping_status` = 'cancelled', `payment_status` = 'cancelled'
WHERE `orders`.`id` IN ('19')
---
            'shipping_status' => 'cancelled',
            'payment_status' => 'cancelled'
        ];
        $orderModel->update($orderId, $updateData);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '19'
DELETE FROM `orders`
WHERE `id` IN ('19')
---
    public function deleteTransaction($orderId)
    {
        $orderModel = new OrderModel();
        $order = $orderModel->find($orderId);

        if (!$order || $order['user_id'] !== session()->get('user_id')) {
            return redirect()->to('/transactions')->with('error', 'Transaksi tidak ditemukan atau akses ditolak.');
        }

        if ($order['payment_status'] === 'completed') {
            return redirect()->to('/transactions')->with('error', 'Transaksi yang sudah dibayar tidak dapat dihapus.');
        }

        $orderModel->delete($orderId);

SELECT *
FROM `orders`
WHERE `orders`.`id` = '20'
SELECT *
FROM `products`
WHERE `products`.`id` = '3'
---
    public function postUploadProof($orderId)
    {
        $orderModel = new OrderModel();
        $productModel = new ProductModel();

        // Verify the order exists and belongs to the user
        $order = $orderModel->find($orderId);
        if (!$order || $order['user_id'] !== session()->get('user_id')) {
            return redirect()->to('/transactions')->with('error', 'Pesanan tidak ditemukan atau akses ditolak.');
        }

        // Get the file
        $file = $this->request->getFile('proof_image');
        if (!$file->isValid()) {
            return redirect()->to('/order/upload_proof/' . $orderId)->with('error', 'File tidak valid. Pastikan Anda memilih gambar yang benar.');
        }

        // Move the uploaded file
        $fileName = $file->getRandomName();
        $uploadPath = 'uploads/proof/' . $fileName;
        if (!$file->move('uploads/proof', $fileName)) {
            return redirect()->to('/order/upload_proof/' . $orderId)->with('error', 'Gagal mengunggah file. Silakan coba lagi.');
        }

        // Get product details
        $product = $productModel->find($order['product_id']);

UPDATE `products` SET `stock` = 39
WHERE `products`.`id` IN ('3')
---

        // Update stock
        $newStock = $product['stock'] - $order['quantity'];
        $productModel->update($product['id'], ['stock' => $newStock]);

UPDATE `orders` SET `proof_image` = '1749453970_8a47f0a0a95e873ff2c2.png', `payment_status` = 'completed', `status` = 'confirmed'
WHERE `orders`.`id` IN ('20')
---
        log_message('info', 'Stock updated for product ID ' . $product['id'] . '. New stock: ' . $newStock);

        // Update order details
        $orderModel->update($orderId, [
            'proof_image' => $fileName,
            'payment_status' => 'completed',
            'status' => 'confirmed'
        ]);