project_uas_ecommerce/app/Controllers/Product.php

    public function index()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`

    public function detail($id)
    {
        $productModel = new ProductModel();
        $data['product'] = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '3'