project_uas_ecommerce/app/Controllers/Transaction.php

SELECT *
FROM `orders`
WHERE `user_id` = '3'
---
    public function index()
    {
        $orderModel = new OrderModel();
        $userId = session()->get('user_id');
        $transactions = $orderModel->where('user_id', $userId)->findAll();