project_uas_ecommerce/app/Views/cart/payment.php

            <?php foreach ($orders as $order): ?>
                <?php
                $productModel = new \App\Models\ProductModel();
                $product = $productModel->find($order['product_id']);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '3'