project_uas_ecommerce/app/Views/transaction/index.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
            <?php foreach ($transactions as $transaction): ?>
                <?php
                $productModel = new \App\Models\ProductModel();
                $product = $productModel->find($transaction['product_id']);