project_uas_ecommerce/app/Views/templates/header.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
                <?php if (session()->has('user_id')): ?>
                    <?php
                        $userModel = new \App\Models\UserModel();
                        $user = $userModel->find(session()->get('user_id'));